{
    "Home": {
        "Navigation": {
            "home": "Home",
            "about": "About me",
            "skills": "Skills",
            "portfolio": "Portfolio",
            "resume": "Resume",
            "contact": "Contact"
        },
        "Header": {
            "title": "Good to see you!",
            "iam": "I am ",
            "description": "Full Stack developer specializing mainly in JavaScript technology"
        }
    },
    "About": {
        "firstText": "I have been an active sportsman since I was child. I started playing soccer when I turned 6, so I decided to develop my hobby in sports clubs. It lasted untill I was 16 years old. Today I would be playing in the best English or Spanish teams if it were not an injury in the `94th... Of course, it's just a joke",
        "secondText": "When my soccer career ended I decided to pick up a whistle and try my best as soccer referee, which I was through the next 2 years. Then I started training at the gym, where I was interested in powerlifting, but due to fear of injury or other side effects of lifting heavy weights, I have decided to abandon this sport.",
        "thirdText": "",
        "fourthText": "",
        "fifthText": ""
    },
    "Portfolio": {
        "Projects": {
            "Befama": {
                "title": "A 'showcase' type website a company in the fiber industry",
                "shortDesc": "Strona wizytówka dla firmy z branży włókienniczej",
                "desc": "Strona Befamy była moim pierwszym komercyjnym projektem, który udało mi się sprawnie zrealizować. Głównym założeniem strony było przedstawienie maszyn jakie firma jest w stanie zkonstrułować. Dodatkowo pojawił się formularz kontaktowy, przestawienie usług jakie firma oferuje, czy zakładka karier. Strona ta jest w pełni responsywna od małych telefonów do dużych monitorów. Podzielona jest na 4 języki.",
                "challange": "Jak wiadomo strony 'wizytówki' bazują na dużej ilości zdjęć w dobrej jakości. Niestety w tym przypadku miałem bardzo mało zdjęć, a jeżeli już były to w złej jakości. Musiałem polubić się z photoshopem oraz wziąć to pod uwagę podczas tworzenia designu całej witryny. Pomniejszymi wyzwaniami było wykonanie perfekcyjnej responsywności oraz podzielenie aplikacji na różne wersje językowe.",
                "whatLearn": {
                    "text": "Projekt ten jest kamieniem milowym w mojej karierze programisty. Dodał mi wiatru w skrzydła, sprawił, że uwierzyłem w swoje umiejętności, a przy okazji mogłem współpracować z świetnymi ludźmi.",
                    "whatLearnPoints": {
                        "first": "jak pozycjonować strony w internecie (podstawy SEO)",
                        "second": "mechaniki i18n",
                        "third": "jak tworzyć responsywne strony",
                        "fourth": "korzystania z TailwindCSS"
                    }
                }
            },
            "Chatapp": {
                "shortDesc": "Application for real time chat",
                "desc": "",
                "challange": "",
                "whatLearn": ""
            },
            "Selleo": {
                "shortDesc": "Intership as React Developer",
                "desc": "",
                "challange": "",
                "whatLearn": ""
            },
            "Calculator": {
                "shortDesc": "Commercial calculator project for pricing a RES installtions",
                "desc": "",
                "challange": "",
                "whatLearn": ""
            },
            "Revan": {
                "shortDesc": "Web service with advertisements of buildings to renovate",
                "desc": "",
                "challange": "",
                "whatLearn": ""
            },
            "Elearn": {
                "shortDesc": "E-learning platform for salesmans",
                "desc": "",
                "challange": "",
                "whatLearn": ""
            }
        },
        "General": {
            "desc": "Description",
            "challange": "Challange",
            "techStack": "Tech Stack",
            "whatLearn": "What I've learned",
            "iveLearned": "I've leanred:"
        }
    },
    "Documents": {
        "download": "download"
    }
}