{
  "Home": {
    "Navigation": {
      "home": "Home",
      "about": "About me",
      "skills": "Skills",
      "portfolio": "Portfolio",
      "resume": "Resume",
      "contact": "Contact"
    },
    "Header": {
      "title": "Good to see you!",
      "iam": "I am ",
      "description": "Full Stack developer specializing mainly in JavaScript technology"
    }
  },
  "About": {
    "firstText": "I have been an active sportsman since I was child. I started playing soccer when I turned 6, so I decided to develop my hobby in sports clubs. It lasted untill I was 16 years old. Today I would be playing in the best English or Spanish teams if it were not an injury in the `94th... Of course, it's just a joke",
    "secondText": "When my soccer career ended I decided to pick up a whistle and try my best as soccer referee, which I was through the next 2 years. Then I started training at the gym, where I was interested in powerlifting, but due to fear of injury or other side effects of lifting heavy weights, I have decided to abandon this sport.",
    "thirdText": "I have started interesting in Programming at the end of middle school. Then I decided to develop myself as Programmer. Every day I expanded my knowledge in Python, HTML, CSS and JavaScript. In the meantime I discovered React, which I fall in love, beacuse of the JSX, hooks and code readability ",
    "fourthText": "When I gained sufficient knowledge, me and my close friend started offering our services to local companies with outdated or without websites. We offered to create website almost for free just to expand our portfolios. This is how our first commercial projects were created 🏆 🏆",
    "fifthText": "Over time I have been able to get better, more complex projects to work with. Prime example is a calculator for creating quotes for renewable energy installations. More about this project can be found in /Portfolio tab."
  },
  "Portfolio": {
    "Projects": {
      "Befama": {
        "title": "A 'showcase' type website a company in the fiber industry",
        "desc": "Website for Befama was my first commercial project, which I made. The main goal was to present all machines offered by the comapny. There is also contact form, present services and carrer tab. The site is fully responsive from small phones to large desktops and it's divided for 4 languages.",
        "challange": "As we already known showcase page base on images with excellent quality. The problem was I had very few pictures, and even if I did, they were not of good quality. I had to like photoshop and think about it when I was designing entire website. Minor challanges was to make perfect responsivness and split the site into 4 languages.",
        "whatLearn": {
          "text": "This project is a milestone in my programming career. He made me belive in my abilites and at the same time I could work with cool people.",
          "whatLearnPoints": {
            "first": "how to position website on the internet (SEO basics)",
            "second": "i18n workflow",
            "third": "how to create responsive website",
            "fourth": "TailwindCSS usage",
            "fifth": "TypeScript usage"
          }
        }
      },
      "Chatapp": {
        "shortDesc": "Application for real time chat",
        "desc": "Since we have created account and we are logged in we have abillity to send text messages to our friends, whom we can add or remove from friends list. I created this application to learn how web-sockets work.",
        "challange": "Web-sockets work very differently from the rest APIs I coded before. So the biggest challenge was using these web-sockets and following good practices",
        "whatLearn": {
          "text": "",
          "whatLearnPoints": {
            "first": "web-sockets",
            "second": "ExpressJS",
            "third": "connect frontend with backend",
            "fourth": "Prisma ORM usage",
            "fifth": "TypeScript usage"
          }
        }
      },
      "Selleo": {
        "shortDesc": "Intership as React Developer",
        "desc": "I got in a monthly interships to Selleo, what is one of the biggest IT comapnies in my hometown. Previously I was participant of 'CoderDojo' organized by this comapny where mentors teach us how to create code in React and JS. The main goal of this interships was to refactor entire app where emplyees can monitor thier hours worked",
        "challange": "The greates challenge was working with a huge team of 13 interns. During the first few days we had many conflicts, when we try to commit some changes in app. It was my firsr time I worked with other people on a single project, what was an interesting and valuable experience.",
        "whatLearn": {
          "text": "Beside practical knowledge about React, or working with GIT, I learned what an Agile workflow is and how it differs from a Waterfall workflow.",
          "whatLearnPoints": {
            "first": "GIT usage",
            "second": "teamwork"
          }
        }
      },
      "Calculator": {
        "shortDesc": "Commercial calculator project for pricing a RES installtions",
        "desc": "This is the most refined and developed FullStack project I have made. Dozenos of people are using this calcualtor every day. Eariler calculators was written in excel what brings a lot of issues (f.e. it was hard to mainatin or keep one version). For now is one platform, where each salesman or menager has his own account.  The entire application is splitted among 6 calculators for different RES installations. Once the calculations are successfully completed, a PDF quote is generated for the customer. Admin or menager has the ability to create an accounts and charge the commissions, thanks to which they can earn money. Commision included in the menager by admin passes to any salesman working for that menager. Only admin has ability to change prices of each installation part for any menager and working for him salesmans. Thanks to this admin has fully controll over the installation prices. Beside that admin can add news from RES world, important documents to download, when someone makes a quote.",
        "challange": "This project consisted of unending challenges starts from optimization, through design simple user UI/UX to make database connection. I tried to make the design as readable as possible, which wasn't easy looking at the scale of the project.",
        "whatLearn": {
          "text": "Work on this project was an extraordinary experience. First of all I gained experience how to work with client, how to work under time pressure. I also learned how to organize my work so that it runs more smoothly. ",
          "whatLearnPoints": {
            "first": "work with client",
            "second": "app optimization",
            "third": "AWS usage",
            "fourth": "TRPC usage",
            "fifth": "state menager usage"
          }
        }
      },
      "Revan": {
        "shortDesc": "Web service with advertisements of buildings to renovate",
        "desc": "Web service, where users can advertise their estate or part of it to renovation. Person with contractor account can book advertisement. I'm planning to add rating system and chat between user and contractor. I'm creating this project to learn the nestJS framework, which I think will take over node projects. Frontend side I'm doing only to excercise creating React interfaces. App is fully responsive and has 2 themes to choose: dark and light ",
        "challange": "The challange was to learn NestJs from 0 based on documentation. I wanted to create an api with the best project patterns. At frontend I decided to style in SaSS, what was something new for me",
        "whatLearn": {
            "text": "",
            "whatLearnPoints": {
              "first": "best practice to write code in NestJs",
              "second": "write styling in SaSS",
              "third": "create app with themes to choose"
            }
          }
      },
      "Elearn": {
        "shortDesc": "E-learning platform for salesmans",
        "desc": "This project is at the beginning of implementation. When I finish it I will describe it here.",
        "challange": "soon",
        "whatLearn": {
            "text": "soon",
            "whatLearnPoints": {
              "first": "",
              "second": "",
              "third": "",
              "fourth": ""
            }
          }
      }
    },
    "General": {
      "desc": "Description",
      "challange": "Challange",
      "techStack": "Tech Stack",
      "whatLearn": "What I've learned",
      "iveLearned": "I've leanred:"
    }
  },
  "Documents": {
    "download": "download"
  }
}
