{
  "Home": {
    "Navigation": {
      "home": "Home",
      "about": "O mnie",
      "skills": "Umiejtnoci",
      "portfolio": "Portfolio",
      "resume": "Dokumenty",
      "contact": "Kontakt"
    },
    "Header": {
      "title": "Mio ci widzie!",
      "iam": "Nazywam si ",
      "description": "jestem Full Stack developerem specjalizujcym si g贸wnie w technologiach JavaScript`owych"
    }
  },
  "About": {
    "firstText": "Od dziecka jestem aktywnym sportowcem. W wieku 6 lat zaczem gra w pik no偶n i w zwizku z tym postanowiem rozwija swoj pasj w r贸偶nych klubach. Trwao to do 16 roku 偶ycia. Dzisiaj grabym w topowych hiszpaskich, czy angielskich klubach, gdyby nie kontuzja w `94-tym... Oczywicie 偶artuje.",
    "secondText": "Po zakoczeniu gry w klubie postanowiem chwyci za gwizdek i zostaem sdzi pikarskim, kt贸rym byem przez kolejne 2 lata. Nastpnie zaczem regularnie chodzi na siowni, gdzie zainteresowa mnie tr贸jb贸j. Jednak z obawy przed kontuzjami i innymi efektami ubocznymi podnoszenia postanowiem zrezygnowa z tej dyscypliny.",
    "thirdText": "Pod koniec gimnazjum zainteresowaem si programowaniem. Wtedy postanowiem rozwija si wanie w takim kierunku. Z biegiem czasu zdobywaem coraz to wiksz wiedz w zakresie Python`a, HTML`a, CSS`a i JavaScript`u. W trakcie rozwijania moich skilli w JavaScript`cie odkryem Reacta, kt贸ry przypad mi do gustu za spraw JSX`a, hook`贸w oraz czytlenoci napisanego kodu.",
    "fourthText": "Po nabyciu odpwiedniej wiedzy, wraz z koleg postanowilimy odwiedza firmy, kt贸rych strony internetowe byy albo przestarzae albo nawet nie istniay. Oferowalimy zrobienie takich stron praktycznie za darmo, w celu poszerzenia naszego portfolio. W ten wanie spos贸b stworzylimy swoje pierwsze komercyjne projekty  ",
    "fifthText": "Z czasem udao mi si poznajdywa coraz to lepsze, czy bardziej rozwinite projekty do wykonania. Jednym z przykad贸w jest kalkulator do tworzenia wycen instalacjii odnawialnych 藕r贸de energii. Wicej o tym projekcie opowiadam w zakadce /Portfolio."
  },
  "Portfolio": {
    "Projects": {
      "Befama": {
        "title": "Strona wizyt贸wka dla firmy z bran偶y w贸kienniczej",
        "desc": "Strona Befamy bya moim pierwszym komercyjnym projektem, kt贸ry udao mi si sprawnie zrealizowa. G贸wnym zao偶eniem strony byo przedstawienie maszyn jakie firma jest w stanie zkonstruowa. Dodatkowo pojawi si formularz kontaktowy, przestawienie usug jakie firma oferuje, czy zakadka karier. Strona ta jest w peni responsywna od maych telefon贸w do du偶ych monitor贸w. Podzielona jest na 4 jzyki.",
        "challange": "Jak wiadomo strony 'wizyt贸wki' bazuj na du偶ej iloci zdj w dobrej jakoci. Niestety w tym przypadku miaem bardzo mao zdj, a je偶eli ju偶 byy to w zej jakoci. Musiaem polubi si z photoshopem oraz wzi to pod uwag podczas tworzenia designu caej witryny. Pomniejszymi wyzwaniami byo wykonanie perfekcyjnej responsywnoci oraz podzielenie aplikacji na r贸偶ne wersje jzykowe.",
        "whatLearn": {
          "text": "Projekt ten jest kamieniem milowym w mojej karierze programisty. Doda mi wiatru w skrzyda, sprawi, 偶e uwierzyem w swoje umiejtnoci, a przy okazji mogem wsp贸pracowa z wietnymi lud藕mi.",
          "whatLearnPoints": {
            "first": "jak pozycjonowa strony w internecie (podstawy SEO)",
            "second": "mechaniki i18n",
            "third": "jak tworzy responsywne strony",
            "fourth": "korzystania z TailwindCSS",
            "fifth": "praca z TypeScriptem"
          }
        }
      },
      "Chatapp": {
        "title": "Aplikacja oferujca chat w czasie rzeczywistym",
        "desc": "Po stworzeniu konta i zalogowaniu si mamy mozliwo pisania wiadomoci z przyjaci贸mi, kt贸rych mozemy dodawa lub usuwa z listy znajomych. Napisaem taplikacj w celu nauczenia si i zrozumienie dziaania web socket贸w.  ",
        "challange": "Wyzwaniem tego projektu byo korzystanie z web socket贸w, poniewaz nigdy wczeniej nie miaem okazji z nich korzysta, a dziaaj one zupenie inaczej niz dotychczasowe api, kt贸re pisaem ",
        "whatLearn": {
          "text": "",
          "whatLearnPoints": {
            "first": "web-sockets",
            "second": "podstaw expressJS",
            "third": "poczenia strony klienckiej z backendow",
            "fourth": "korzystanie z ORM - prisma",
            "fifth": "praca z TypeScriptem"
          }
        }
      },
      "Selleo": {
        "title": "Praktyki jako React Developer",
        "desc": "Bdc na wakacjach dostaem informacj, ze dostaem si na miesiczne praktyki do Selleo, czyli pionierskiej firmy IT w moim rodzinnym miecie. Akurat wczeniej uczestniczyem w organizowanych przez nich 'CoderDojo', w kt贸rych menotrzy uczyli nas programowania (wtedy akurat JS'a oraz React'a). Na praktykach przerabialimy wewntrzn aplikacj do monitorowania godzin pracy pracownik贸w tej firmy.",
        "challange": "Najwikszym wyzwaniem bya praca w duzym 13-osobowym zespole praktykant贸w. Czsto mielimy wiele konflikt贸w, podczas commitowania zmian w aplikacji. Pierwszy raz pracowaem z kodem napisanym przez kogo innego, co byo ciekawym i wartym nauczenia si dowiadczeniem.",
        "whatLearn": {
          "text": "Poza praktyczn wiedz z React'a, czy korzystania z narzdzia GIT, nauczyem si na czym polega Agailowa metoda pracy oraz czym r贸zni si od Waterfall'owego podejcia. Zobaczyem takze, jak pracuje si w duzym zespole",
          "whatLearnPoints": {
            "first": "pracy z GIT'em",
            "second": "pracy zespoowej"
          }
        }
      },
      "Calculator": {
        "title": "Komercyjny projekt kalkulatora do tworzenia wycen instalacji OZE",
        "desc": "Jest to najbardziej dopracowany oraz rozwinity projekt jaki zrobiem do tej pory, na co dzie korzystaj z niego dziesitki os贸b. Wczeniejsze kalkulatory byy napisane w excell'u, co byo trudne w utrzymaniu, poniewa偶 ci偶ko byo utrzyma jedn wersj kalkulatora u wszystkich pracownik贸w. Teraz jest jedna platforma, do kt贸rej ka偶dy pracownik ma przypisane swoje konto handlowca, bd藕 menagera. Caa aplikacja podzielona jest na 6 kalkulator贸w do r贸偶nych instlacjii odnawialnych 藕r贸de energii. Po zakoczonej wycenie dla klienta generowanana jest wycena w formacie PDF. Administrator lub menager ma mo偶liwo stworzenia nowych kont, nao偶enia na nie prowizjii, dziki kt贸rej zarabiaj. Administrator jest w stanie zmieni ceny poszczeg贸lnych element贸w instalacji dla ka偶dego menagera i pracujcych pod nim handlowc贸w, dziki czemu ma pen kontrol nad cenami w kalkulatorach. Poza tym administrator mo偶e dodawaaktualnoci ze wiata OZE oraz pliki, kt贸re handlowiec musi doczy do wyceny dla klienta.",
        "challange": "Projekt ten skada si z samych wyzwa zaczynajc od optymalizacji, przez zaprojektowanie prostego dla u偶ytkownika UI/UX, po podcznie bazy danych. Staraem si, 偶eby kod by jak najbardziej czytelny dla kogo kto pierwszy raz ma z nim styczo, co jest bardzo ci偶kim zadaniem przy wikszych projektach.",
        "whatLearn": {
          "text": "Praca nad tym projektem bya niesamowitym dowiadczeniem. Przede wszystkim nauczyem si pracy z klientem, pracy pod presjczasu, musiaem nauczy sipanowa nad stresem i mimo tego trze藕wo myle podczas pisania kodu. Nauczyem si tak偶e jak dobrze organizowa prac, 偶eby sza ona sprawniej.",
          "whatLearnPoints": {
            "first": "pracy z klientem",
            "second": "optymalizacji apliakcji",
            "third": "pracy z AWS",
            "fourth": "pracy z TRPC",
            "fifth": "pracy z state menagerem"
          }
        }
      },
      "Revan": {
        "title": "Serwis internetowy z ogoszeniami nieruchomoci do renowacji",
        "desc": "Serwis internetowy, na kt贸rym u偶ytkownicy mog wystawi sw贸j dom/mieszkanie lub jego czdo renowacji. Osoba majca konto wykonawcy mo偶e zarezerwowa takie ogoszenie dla siebie. Planuje dodamo偶liwo wystawiania opinii dla konkretnego wykonawcy oraz chat midzy u偶ytkownikiem, a wykonawc. Robi ten projekt w celu nauczenia siframework'a nestJS, kt贸ry w mojej opinii bdzie pr偶nie przejmowa node'owe backendy w bran偶y. Czfrontend'ow robistrikte w celu przewiczenia tworzenia interfejs贸w w React'cie. Oczywicie aplikacja jest w peni responsywna. Posiada 2 kolorystyki do wyboru: ciemn oraz jasn",
        "challange": "Wyzwaniem byo nauka NestJs od 0 na podstawie dokumentacji, chciaem sttworzy apiz najlepszymi wzorcami projektowymi. W czci frontend'owej postawiem na stylowanie w SaSS, co te偶 byo dla mnie nowoci",
        "whatLearn": {
          "text": "",
          "whatLearnPoints": {
            "first": "najpszych praktyk pisania kodu w NesJS",
            "second": "stylowania aplikacji za pomoc SaSS",
            "third": "tworzenia aplikacji z wyborem motywu"
          }
        }
      },
      "Elearn": {
        "title": "Platforma e-learningowa dla handlowc贸w",
        "desc": "Projekt ten jest na pocztku realizacji, gdy zostanie skoczony opisz go tutaj",
        "challange": "",
        "whatLearn": {
          "text": "",
          "whatLearnPoints": {
            "first": "",
            "second": "",
            "third": "",
            "fourth": ""
          }
        }
      }
    },
    "General": {
      "desc": "Opis",
      "challange": "Wyzwanie",
      "techStack": "Tech Stack",
      "whatLearn": "Czego si nauczyem",
      "iveLearned": "Nauczyem si:"
    }
  },
  "Documents": {
    "download": "pobierz"
  }
}
